extension/InformationRegisters/КалендарьЗаписей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>КалендарьЗаписей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаписи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Мастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Мастера</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВизита</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

extension/InformationRegisters/КалендарьЗаписей/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("ЗакрытиеФормыЗаписи", Запись, ЭтотОбъект.ВладелецФормы);
КонецПроцедуры

&НаКлиенте
Процедура УслугаПриИзменении(Элемент)
	УстановитьДлительность(Запись.Услуга);
КонецПроцедуры

&НаСервере
Процедура УстановитьДлительность(Услуга)
	Запись.Длительность = Услуга.Длительность;
КонецПроцедуры	


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Менеджер =РегистрыСведений.КалендарьЗаписей.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Менеджер, Запись);
	Менеджер.Прочитать();
	Если Менеджер.Выбран() Тогда
		Менеджер.Удалить();
	КонецЕсли;	   
	Менеджер =РегистрыСведений.КалендарьЗаписей.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Менеджер, Запись);
	Менеджер.Записать(Истина);
КонецПроцедуры
